profiling/put_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 0.951ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.950ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.951ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.954ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  479.42us   6.89ms   60.89%
    Req/Sec     2.64k   159.46     3.56k    83.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.32ms
 90.000%    1.63ms
 99.000%    1.84ms
 99.900%    1.91ms
 99.990%    2.89ms
 99.999%    6.26ms
100.000%    6.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.024     0.000000            1         1.00
       0.267     0.100000        20001         1.11
       0.485     0.200000        40023         1.25
       0.700     0.300000        60058         1.43
       0.844     0.400000        80073         1.67
       0.951     0.500000       100039         2.00
       1.006     0.550000       110004         2.22
       1.061     0.600000       120006         2.50
       1.118     0.650000       130084         2.86
       1.212     0.700000       139977         3.33
       1.319     0.750000       150021         4.00
       1.372     0.775000       154996         4.44
       1.428     0.800000       160062         5.00
       1.480     0.825000       165041         5.71
       1.530     0.850000       170064         6.67
       1.581     0.875000       175015         8.00
       1.608     0.887500       177536         8.89
       1.634     0.900000       179993        10.00
       1.661     0.912500       182473        11.43
       1.689     0.925000       185048        13.33
       1.716     0.937500       187484        16.00
       1.729     0.943750       188711        17.78
       1.743     0.950000       189961        20.00
       1.758     0.956250       191256        22.86
       1.772     0.962500       192560        26.67
       1.785     0.968750       193756        32.00
       1.792     0.971875       194379        35.56
       1.799     0.975000       194963        40.00
       1.806     0.978125       195589        45.71
       1.814     0.981250       196223        53.33
       1.822     0.984375       196873        64.00
       1.826     0.985938       197177        71.11
       1.831     0.987500       197463        80.00
       1.836     0.989062       197768        91.43
       1.842     0.990625       198108       106.67
       1.848     0.992188       198393       128.00
       1.852     0.992969       198587       142.22
       1.855     0.993750       198717       160.00
       1.859     0.994531       198867       182.86
       1.865     0.995313       199024       213.33
       1.870     0.996094       199180       256.00
       1.873     0.996484       199258       284.44
       1.877     0.996875       199346       320.00
       1.881     0.997266       199420       365.71
       1.886     0.997656       199501       426.67
       1.891     0.998047       199573       512.00
       1.894     0.998242       199609       568.89
       1.897     0.998437       199644       640.00
       1.901     0.998633       199684       731.43
       1.906     0.998828       199722       853.33
       1.914     0.999023       199761      1024.00
       1.919     0.999121       199781      1137.78
       1.924     0.999219       199800      1280.00
       1.933     0.999316       199820      1462.86
       1.938     0.999414       199839      1706.67
       1.948     0.999512       199859      2048.00
       1.952     0.999561       199868      2275.56
       1.963     0.999609       199877      2560.00
       1.983     0.999658       199887      2925.71
       2.000     0.999707       199897      3413.33
       2.039     0.999756       199908      4096.00
       2.055     0.999780       199912      4551.11
       2.107     0.999805       199916      5120.00
       2.219     0.999829       199921      5851.43
       2.463     0.999854       199926      6826.67
       2.705     0.999878       199931      8192.00
       2.853     0.999890       199934      9102.22
       2.981     0.999902       199936     10240.00
       3.079     0.999915       199938     11702.86
       3.303     0.999927       199941     13653.33
       3.367     0.999939       199943     16384.00
       3.665     0.999945       199945     18204.44
       3.957     0.999951       199946     20480.00
       4.287     0.999957       199947     23405.71
       4.619     0.999963       199948     27306.67
       4.943     0.999969       199949     32768.00
       5.275     0.999973       199950     36408.89
       5.599     0.999976       199951     40960.00
       5.599     0.999979       199951     46811.43
       5.931     0.999982       199952     54613.33
       5.931     0.999985       199952     65536.00
       6.255     0.999986       199953     72817.78
       6.255     0.999988       199953     81920.00
       6.255     0.999989       199953     93622.86
       6.575     0.999991       199954    109226.67
       6.575     0.999992       199954    131072.00
       6.575     0.999993       199954    145635.56
       6.575     0.999994       199954    163840.00
       6.575     0.999995       199954    187245.71
       6.891     0.999995       199955    218453.33
       6.891     1.000000       199955          inf
#[Mean    =        0.954, StdDeviation   =        0.479]
#[Max     =        6.888, Total count    =       199955]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299996 requests in 30.00s, 19.17MB read
Requests/sec:   9999.68
Transfer/sec:    654.28KB